* Baseboard

** Dining room

|     raw | buffered | group |
|---------+----------+-------|
|     3.5 |        5 | g     |
|      48 |       50 | h     |
|     8.5 |       10 | b     |
|      63 |       65 | g     |
|     8.5 |       10 | b     |
|     9.5 |       12 | a     |
|      69 |       72 | a     |
|      87 |       90 | b     |
|      48 |       50 | e     |
|      33 |       36 | a     |
|---------+----------+-------|
| *total* |      401 |       |
   #+TBLFM: $2=vsum(@2..@-1)

** Living room

|     raw | buffered | group |
|---------+----------+-------|
|      33 |       36 | h     |
|      13 |       14 | g     |
|       8 |       10 | c     |
|       6 |        8 | f     |
|      21 |     22.5 | d     |
|      60 |     61.5 | d     |
|      29 |       31 | f     |
|      43 |       45 | f     |
|      31 |       33 | h     |
|      32 |       34 | e     |
|     108 |      110 | c     |
|---------+----------+-------|
| *total* |      411 |       |
   #+TBLFM: $2=vsum(@2..@-1)


** Bathroom hall

| raw | buffered | group |
|-----+----------+-------|
|  63 |       64 | i     |
|  51 |       52 | j     |
|  13 |       14 | j     |
|  22 |       23 | i     |
|  16 |       17 | j     |



** Groups

- a :: 72 + 36 + 12 = 120
- b :: 90 + 10 + 10 = 120
- c :: 110 + 10 = 120
- d :: 61.5 + 22.5 = 84
- e :: 50 + 34 = 84
- f :: 45 + 31 + 8 = 84
- g :: 65 + 14 + 5 = 84
- h :: 50 + 36 + 33 = 119 = 120
- i :: 64 + 23 = 87 = 96
- j :: 52 + 17 + 14 = 83 = 96
- total :: 4 x 10' ; 4 x 7' = 68'

* Trim
** Windows and doors (3.5")
|            |  raw | buffered | group |   |
|------------+------+----------+-------+---|
| front d    | 80.5 |       84 | m     |   |
| front d    | 80.5 |       84 | n     |   |
| front d    |   36 |       44 | v     |   |
| closet     |   80 |       84 | o     |   |
| closet     |   80 |       84 | p     |   |
| closet     |   49 |       57 | s     | x |
| office     |   82 |       86 | 96    |   |
| office     |   82 |       86 | 96    |   |
| office     |   32 |       40 | 96    |   |
| kitchen    |   83 |       88 | 96    |   |
| kitchen    |   83 |       88 | 96    |   |
| kitchen    | 32.5 |       41 | v     |   |
|------------+------+----------+-------+---|
| connie     | 32.5 |       40 | t     |   |
| connie     | 32.5 |       40 | u     |   |
| connie     | 53.5 |       62 | 96    |   |
| connie     | 53.5 |       62 | 96    |   |
| front lawn | 45.5 |       54 | t     |   |
| front lawn | 45.5 |       54 | u     |   |
| front lawn | 46.5 |       55 | q     |  x |
| front lawn | 46.5 |       55 | r     |  x |
|------------+------+----------+-------+---|
| din arch   |   54 |       63 | 96    |   |
| din arch   |   54 |       63 | 96    |   |
| din arch   |   94 |       99 | a     |   |
| din arch   |   94 |       99 | b     |   |
| din arch   |   94 |       99 | c     |   |
| din arch   |   94 |       99 | d     |   |
| entry arch |   67 |       75 | 96    |   |
| entry arch |   67 |       75 | 96    |   |
| entry arch | 94.5 |      100 | h     |   |
| entry arch | 94.5 |      100 | j     |   |
| entry arch | 94.5 |      100 | k     |   |
| entry arch | 94.5 |      100 | l     |   |
|------------+------+----------+-------+---|
| bath       |   28 |       37 | s     |   |
| bath       |   82 |       87 | i     |   |
| bath       |   82 |       87 | 96    |   |
| kitchen    |   30 |       39 | q     |   |
| kitchen    |   82 |       87 | 96    |   |
| kitchen    |   82 |       87 | 96    |   |
| stair      |   30 |       39 | r     |   |
| stair      |   82 |       87 | 96    |   |
| stair      |   82 |       87 | 96    |   |
| closet     |   22 |       31 | i     |   |
| closet     |   80 |       85 | 96    |   |
| closet     |   80 |       85 | 96    |   |

** Windows (2.25")

|  raw | buffered | group |
|------+----------+-------|
|   25 |       27 | l     |
|   25 |       27 | m     |
|   77 |       80 | l     |
|   77 |       80 | m     |
|   25 |       27 | n     |
|   25 |       27 | o     |
|   77 |       80 | n     |
|   77 |       80 | o     |
| 29.5 |       32 | p     |
| 29.5 |       32 | q     |
|   77 |       80 | p     |
|   77 |       80 | q     |


** Reworked groups

- a :: 99 = 120
- b :: 99 = 120
- c :: 99 = 120
- d :: 99 = 120 
- e :: 120
- f :: 120
- g :: 120 
- h :: 100 = 120
- i :: 87 + 31 = 118 = 120
- j :: 100 = 120
- k :: 100 = 120
- l :: 100 = 120
- m :: 7
- n :: 7
- o :: 7
- p :: 7
- q :: 55 + 39 = 94 = 96
- r :: 55 + 39 = 94 = 96
- s :: 57 + 37 = 94 = 96
- t :: 54 + 40 = 94 = 96
- u :: 54 + 40 = 94 = 96
- v :: 44 + 41 = 85 = 96

If no hallway, 7 x 8' lengths not needed and rearrange these:
- i :: 55 + 57 = 112 = 120
- q :: 55 = 96
- r :: -
- s :: -

9 x 8' lengths in trim required for hallway; 2 x 8' baseboard. Total
hallway cost: $202.4

Arches will require: 15 x 8': $276

* Doors

- Height (floor to top corner): 85in
- Width (corner to corner): 39in
- Doors: entry, dining/office x 2, dining/kitchen, office closet, entry
  closet (55in wide)

~1275in or ~108 ft

* Grand Total

| type    | length | cost/ft |   sub |
|---------+--------+---------+-------|
| base    |     90 |    1.55 | 139.5 |
| door    |    108 |    1.40 | 151.2 |
| window  |     70 |    1.40 |   98. |
|---------+--------+---------+-------|
| *total* |        |         | 388.7 |

Minus office
| type    | length | cost/ft |    sub |
|---------+--------+---------+--------|
| base    |     65 |    1.55 | 100.75 |
| door    |     73 |    1.40 |  102.2 |
| window  |     60 |    1.40 |    84. |
|---------+--------+---------+--------|
| *total* |        |         | 286.95 |
#+TBLFM: $2=108-(((170+40)*2)/12)::$4=vsum(@2..@-1)

* Walls

- Kitchen :: 56 high, 165 x 160, really only two walls (126 ft^2) 
- Dining :: 108 high, 165 x 147 (242 ft^2)
- Living :: 108 high, 160 x 170 (256 ft^2)
- Bath :: 57 high, 49 x 65 (45 ft^2)
* Doorway pieces required:

- Entry way sides: 95 x 5.25 (2)
- Entry way top: 67 x 5.25
- Dining room top: 55 x 6.5

Office is covered with pieces in garage; just get one planed to 3/4
- Office sides: 4.5, 4 x 82 (3/4") 
- Office top: 5 x 30 (1")
